In [1]:
import pandas as pd

In [3]:
# Series
# A pandas series is a one-dimensional array-like object that can hold any data type. It is similar to column in a table

import pandas as pd
data = [1, 2, 3, 4, 5]
series = pd.Series(data)

print("Series:\n",series) 
print(type(series))

Series:
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [4]:
# Create a series from a dictionary
import pandas as pd

data = {'a': 1, 'b': 2, 'c': 3}

series_dict = pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [6]:
# different index names
data = [10, 20 ,30]
index = ['a', 'b', 'c']

print(pd.Series(data, index=index))

a    10
b    20
c    30
dtype: int64

In [ ]:
# DataFrame
# A pandas DataFrame is a two-dimensional data structure that can hold different data types in each column. It is similar to a table in Excel or a spreadsheet in Google Docs.

In [28]:
# Create a dataframe from a dictionary of list

data = {
    'Name': ['Harsh', 'Praju', 'Preeti'],
    'Age' : [27, 19, 27],
    'City' : ['Delhi', 'Pune', 'Mumbai']
}

df = pd.DataFrame(data)
print(df)
print(type(df))

     Name  Age    City
0   Harsh   27   Delhi
1   Praju   19    Pune
2  Preeti   27  Mumbai
<class 'pandas.core.frame.DataFrame'>

In [12]:
import numpy as np

np.array(df)

array([['Harsh', 27, 'Delhi'],
       ['Praju', 19, 'Pune'],
       ['Preeti', 27, 'Mumbai']], dtype=object)

In [24]:
# Create a dataframe from a list of dictionaries

data = [
    {'Name':'Harsh', 'Age':27, 'City':'Delhi'},
    {'Name': 'Praju', 'Age': 19, 'City':'Pune'},
    {'Name': 'Preeti', 'Age': 27, 'City':'Mumbai'},
    {'Name': 'John', 'Age': 65, 'City':'New York'}
]

df2 = pd.DataFrame(data)
print(df2)
print(type(df2))

     Name  Age      City
0   Harsh   27     Delhi
1   Praju   19      Pune
2  Preeti   27    Mumbai
3    John   65  New York
<class 'pandas.core.frame.DataFrame'>

In [25]:
df3 = pd.read_csv('train.csv')
df3.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [26]:
df3.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [29]:
# Accessing data from dataframe

df

     Name  Age    City
0   Harsh   27   Delhi
1   Praju   19    Pune
2  Preeti   27  Mumbai

In [31]:
type(df['Name'])

pandas.core.series.Series

In [36]:
df.loc[0]
df.loc[0]['Name']

'Harsh'

In [46]:
df.iloc[0]['Age']

np.int64(27)

In [43]:
# Accessing a specified element
print(df)

print(df.at[2, 'Name'])

     Name  Age    City
0   Harsh   27   Delhi
1   Praju   19    Pune
2  Preeti   27  Mumbai
Preeti

In [ ]:
# Accessing specified element using iat
df.iat[2, 2]

'Mumbai'

In [48]:
# Data Manipulation

# Adding a column
df['Salary'] = [50000, 65000, 75000]
df

     Name  Age    City  Salary
0   Harsh   27   Delhi   50000
1   Praju   19    Pune   65000
2  Preeti   27  Mumbai   75000

In [53]:
# Remove a column

df.drop('Salary', axis=1, inplace=True)
df

     Name  Age    City
0   Harsh   27   Delhi
1   Praju   19    Pune
2  Preeti   27  Mumbai

In [56]:
# Add age to the column

df['Age'] = df['Age']+1
df

     Name  Age    City
0   Harsh   30   Delhi
1   Praju   22    Pune
2  Preeti   30  Mumbai

In [59]:
df.drop(0, inplace=True)
df

     Name  Age    City
1   Praju   22    Pune
2  Preeti   30  Mumbai

In [60]:
df = pd.read_csv('train.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [65]:
# Display the data type of each column
print("Data type:\n", df.dtypes)

print()

# Describe the dataframe
print("Statistics:\n", df.describe())

print()

# Group by column and perform an aggregation
grouped = df.groupby('Sex')['Survived'].mean()
print("Mean value by category:\n", grouped)

Data type:
 PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

Statistics:
        PassengerId    Survived      Pclass         Age       SibSp  \
count   891.000000  891.000000  891.000000  714.000000  891.000000
mean    446.000000    0.383838    2.308642   29.699118    0.523008
std     257.353842    0.486592    0.836071   14.526497    1.102743
min       1.000000    0.000000    1.000000    0.420000    0.000000
25%     223.500000    0.000000    2.000000   20.125000    0.000000
50%     446.000000    0.000000    3.000000   28.000000    0.000000
75%     668.500000    1.000000    3.000000   38.000000    1.000000
max     891.000000    1.000000    3.000000   80.000000    8.000000

            Parch        Fare
count  891.000000  891.000000
mean     0.381594   32.204208
std      0.806057   49.693429
min      0.000000    0.000000
25%      0.000000    7.910400
50%      0.000000   14.454200
75%      0.000000   31.000000
max      6.000000  512.329200

Mean value by category:
 Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64